importing libraries

In [ ]:
import pandas as pd
import numpy as np

reading file to create dataframe

In [12]:
df = pd.read_csv("C:/2-Dataset/income.xls")

In [13]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [14]:
df.describe

<bound method NDFrame.describe of         Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000>

In [15]:
df.describe()

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

column name change

In [16]:
df.columns = ["Name","income"]

In [17]:
df

        Name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [18]:
df.income.quantile(1)

10000000.0

In [19]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [20]:
df_no_outlier = df[df.income<=percentile_99]
df_no_outlier

    Name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000